# Задача 16: Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai
# . Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3
# -> 1

n = int(input())
a = []
x = input()
count = 0
for i in range(n):
    a.append(input())
    if x == a[i]:
        count += 1
#a = [i for i in range(int(input())) if x == a[i] count += 1]
print(a)
print(count)

