# Задача 2: Найдите сумму цифр трехзначного числа.

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)



a = input("Введите число: ")
i = 0
summ = 0
 
while i < len(a):
    summ += int(a[i])
    i = i + 1

print(summ)